/************************************************************
 *
 * Mutations处理 以 M_ 开头
 *
 ************************************************************/

/**
 * 本地设置Data;
 * 参数模式：_this[M_GET_DATA](data);
 * @data:
 */
export const M_GET_DATA = 'M_GET_DATA';

export const M_SET_ACTIVENAME = 'M_SET_ACTIVENAME';

export const M_SET_TREENODE = 'M_SET_TREENODE';

/************************************************************
 *
 * Actions 处理 以 A_ 开头
 *
 ************************************************************/

/**
 * 异步请求获取Data信息;
 * 参数模式：_this[A_GET_DATA]({data});
 * @data:
 */
export const A_GET_DATA = 'A_GET_DATA';

/************************************************************
 *
 * Getter 处理 以 G_ 开头
 *
 ************************************************************/
